In [81]:
import unicodecsv

#read data from CSV file and make it to lists
def read_csv(filename):
    with open(filename, 'rb') as f:
        reader = unicodecsv.DictReader(f)
        return list(reader)

In [82]:
user = read_csv('../data_20180120/customer.csv')

In [161]:
import pandas as pd

users = pd.DataFrame(user)
users[:5]

,CUSTOMER_ID,FIRST_NAME,IS_DESIGNER,BPCODE,ADDRESS_NO,ADDRESS_POSTAL_CODE,ADDRESS_PROVINCE_ID,ADDRESS_PROVINCE,ADDRESS_STREET,ADDRESS_DISTRICT_ID,ADDRESS_DISTRICT,ADDRESS_SUB_DISTRICT_ID,ADDRESS_SUB_DISTRICT,ADDRESS_TYPE,ADDRESS_BUILDING,ADDRESS_OFFICE_NAME,DATE_OF_BIRTH
0,"2,083",ฐนันทิพย์,N,1100698858,2,20170,04090000000,จ.ชลบุรี,เซิดน้อย,04094570000,อ.บ้านบึง,04094573409,ต.บ้านบึง,บ้านพักอาศัย,เอเชีย,Cupcode,1988-10-30
1,"2,102",ทดสอบ002,N,1900036840,,,,,,,,,,,,,
2,"2,223",Ping,N,1900036887,,,,,,,,,,,,,
3,"2,224",มาศสุภา,N,1900036888,,,,,,,,,,,,,
4,"2,284",Tanate,N,1900036922,,,,,,,,,,,,,

In [79]:
users['CUSTOMER_ID'][:5]

0    2,083
1    2,102
2    2,223
3    2,224
4    2,284
Name: CUSTOMER_ID, dtype: object

In [80]:
users['DATE_OF_BIRTH'][:5]

0    1988-10-30
1
2
3
4
Name: DATE_OF_BIRTH, dtype: object

In [78]:
ID = users['CUSTOMER_ID']
ID[:5]

0    2,083
1    2,102
2    2,223
3    2,224
4    2,284
Name: CUSTOMER_ID, dtype: object

In [243]:
import locale
locale.setlocale(locale.LC_ALL, '') 

new_id = result[:]
new_id['CUSTOMER_ID'] = result['CUSTOMER_ID'].apply(locale.atoi)
new_id[:5]

   CUSTOMER_ID
0         2083
1         2102
2         2223
3         2224
4         2284

In [77]:
BD = users['DATE_OF_BIRTH']
BD[:5]

0    1988-10-30
1
2
3
4
Name: DATE_OF_BIRTH, dtype: object

In [244]:
result = pd.concat([new_id, BD], axis=1)

In [245]:
result[:5]

   CUSTOMER_ID DATE_OF_BIRTH
0         2083    1988-10-30
1         2102
2         2223
3         2224
4         2284

# ID & Birth

In [248]:
Id_birth = result[result['DATE_OF_BIRTH'].notnull() & (result['DATE_OF_BIRTH'] != "")]
Id_birth[:5]

    CUSTOMER_ID DATE_OF_BIRTH
0          2083    1988-10-30
13         2390     1986-8-11
16         2406    1983-10-10
21         2412    1989-10-25
22         2413      1982-6-4

In [249]:
Id_birth.to_csv('../data_clean/customer.csv')

In [250]:
AD = users['ADDRESS_POSTAL_CODE']
AD[:5]

0    20170
1
2
3
4
Name: ADDRESS_POSTAL_CODE, dtype: object

In [252]:
results = pd.concat([new_id,BD,AD], axis=1)
results[:5]

   CUSTOMER_ID DATE_OF_BIRTH ADDRESS_POSTAL_CODE
0         2083    1988-10-30               20170
1         2102
2         2223
3         2224
4         2284

ID&Birth&address

In [253]:
df_add_not_null = results [results['ADDRESS_POSTAL_CODE'].notnull() & (results['ADDRESS_POSTAL_CODE'] != "") & (results['DATE_OF_BIRTH'].notnull() &(results['DATE_OF_BIRTH'] != ""))]


df_add_not_null[:5]

    CUSTOMER_ID DATE_OF_BIRTH ADDRESS_POSTAL_CODE
0          2083    1988-10-30               20170
13         2390     1986-8-11               10250
16         2406    1983-10-10               10150
21         2412    1989-10-25               11110
22         2413      1982-6-4               11000

In [254]:
df_add_not_null.to_csv('../data_clean/customer.csv')

# birth

In [255]:
y_m_d = df_add_not_null['DATE_OF_BIRTH']
y_m_d[:5]

0     1988-10-30
13     1986-8-11
16    1983-10-10
21    1989-10-25
22      1982-6-4
Name: DATE_OF_BIRTH, dtype: object

In [256]:
from datetime import datetime
now = datetime.now()
now

datetime.datetime(2018, 2, 5, 15, 31, 37, 800110)

In [257]:
 y = now.year
y

2018

In [258]:
 y- int('1988')

30

In [259]:
from datetime import datetime

def bd_to_age(bd_str):
    datetime_ob = datetime.strptime(bd_str, '%Y-%m-%d').date()
    now = datetime.now().date()
    delta = (now - datetime_ob)
    number_of_days = delta.days
    number_of_years = number_of_days/365
    return number_of_years

In [262]:
bd_to_age('1988-10-30')

29.28767123287671

In [263]:
birth_not_null = users[users['DATE_OF_BIRTH'].notnull() &(users['DATE_OF_BIRTH'] != "")]['DATE_OF_BIRTH']
birth_not_null[0:5]

0     1988-10-30
13     1986-8-11
16    1983-10-10
21    1989-10-25
22      1982-6-4
Name: DATE_OF_BIRTH, dtype: object

# Age

In [264]:
 age = birth_not_null.apply(bd_to_age)
age[:5]

0     29.287671
13    31.509589
16    34.347945
21    28.301370
22    35.698630
Name: DATE_OF_BIRTH, dtype: float64

In [265]:
birth_not_null.to_csv('../data_clean/customer.csv')

In [266]:
users_all = pd.concat([df_add_not_null,age], axis=1)
users_all[:5]

    CUSTOMER_ID  DATE_OF_BIRTH ADDRESS_POSTAL_CODE  DATE_OF_BIRTH
0        2083.0     1988-10-30               20170      29.287671
13       2390.0      1986-8-11               10250      31.509589
16       2406.0     1983-10-10               10150      34.347945
21       2412.0     1989-10-25               11110      28.301370
22       2413.0       1982-6-4               11000      35.698630

In [267]:
users_all['Age'] = age

In [268]:
users_all[:5]

    CUSTOMER_ID  DATE_OF_BIRTH ADDRESS_POSTAL_CODE  DATE_OF_BIRTH        Age
0        2083.0     1988-10-30               20170      29.287671  29.287671
13       2390.0      1986-8-11               10250      31.509589  31.509589
16       2406.0     1983-10-10               10150      34.347945  34.347945
21       2412.0     1989-10-25               11110      28.301370  28.301370
22       2413.0       1982-6-4               11000      35.698630  35.698630

In [269]:

del users_all['DATE_OF_BIRTH']
users_all

       CUSTOMER_ID ADDRESS_POSTAL_CODE        Age
0           2083.0               20170  29.287671
13          2390.0               10250  31.509589
16          2406.0               10150  34.347945
21          2412.0               11110  28.301370
22          2413.0               11000  35.698630
24          2416.0               10280  35.852055
26          2082.0               11120  41.315068
27          2142.0               10140  29.509589
32          2291.0               12130  33.594521
36          2316.0               10250  22.567123
42          2391.0               11110  29.734247
52          2426.0               11130  38.852055
53          2085.0               10330  21.109589
57          2229.0               21140  34.219178
59          2243.0               11150  37.386301
63          2264.0               10700  43.800000
66          2309.0               10260  36.786301
73          2392.0               10240  41.616438
74          2402.0               11000  36.243836
75          2405.0               10210  34.213699
79          2182.0               24110  27.701370
84          2233.0               10330  28.610959
87          2246.0               10540  34.087671
93          2305.0               10540  34.156164
101         2337.0               10160  33.542466
104           41.0               10140   2.334247
105         1042.0               12345   6.526027
106         2084.0               20170  29.287671
119         2365.0               10140  26.898630
122         2369.0               10150  32.032877
...            ...                 ...        ...
36104     241722.0               10900  32.323288
36106     242002.0               10540  39.602740
36110     243522.0               12120  23.317808
36111     243582.0               67140  23.589041
36117     245542.0               10150  28.706849
36119     256762.0               10140  40.827397
36122     227602.0               10150  28.117808
36126     232264.0               10400  34.383562
36127     232762.0               73000  23.898630
36132     238842.0               11000  60.695890
36136     242442.0               80110  36.830137
36139     243122.0               50210  60.939726
36141     244063.0               10150  32.619178
36145     248702.0               10300  28.301370
36147     253903.0               10260  28.150685
36153     257622.0               73110  30.695890
36155     258362.0               12120  34.769863
36157     226543.0               10140  32.312329
36158     227242.0               10160  37.032877
36162     229242.0               11000  35.186301
36171     232302.0               10310  39.471233
36175     232804.0               71170  41.315068
36176     234342.0               10600  29.115068
36181     231222.0               10240  32.183562
36183     257823.0               10220  56.205479
36184     258302.0               10270  25.789041
36186     227002.0               90140  31.128767
36200     239722.0               20000  48.073973
36208     247822.0               10170  29.890411
36209     248022.0               10800  30.063014

[10594 rows x 3 columns]

In [270]:
users_all.to_csv('../data_clean/customer.csv')

# check

In [271]:
users_all.dtypes

CUSTOMER_ID            float64
ADDRESS_POSTAL_CODE     object
Age                    float64
dtype: object

In [293]:
new_age = users_all['Age'].round(0)
new_age[:5]

0     29.0
13    32.0
16    34.0
21    28.0
22    36.0
Name: Age, dtype: float64